app/controllers/logdatas_controller.rb

DELETE FROM "logdata" WHERE "logdata"."id" = $1  [["id", 1]]
---
    def delete
      Logdata.destroy_all()