app/controllers/todos_controller.rb

INSERT INTO "todos" ("content", "created_at", "done", "order", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "sdfsdf"], ["created_at", Mon, 14 Jan 2013 07:30:58 UTC +00:00], ["done", false], ["order", 1], ["updated_at", Mon, 14 Jan 2013 07:30:58 UTC +00:00]]
---
  def create
    @todo = Todo.new(params[:todo])

    respond_to do |format|
      if @todo.save

SELECT "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT 1  [["id", "2"]]
UPDATE "todos" SET "done" = 't', "updated_at" = '2013-01-14 07:31:07.928991' WHERE "todos"."id" = 2
---
  def update
    @todo = Todo.find(params[:id])

    respond_to do |format|
      if @todo.update_attributes(params[:todo])

SELECT "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT 1  [["id", "2"]]
DELETE FROM "todos" WHERE "todos"."id" = $1  [["id", 2]]
---
  def destroy
    @todo = Todo.find(params[:id])
    @todo.destroy